src/Documents/ИТ_ПакетДокументовРезультатовИнвентаризации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>ИТ_ПакетДокументовРезультатовИнвентаризации</Name>
			<BasedOn>
				<xr:Item>Document.ИТ_ПакетДокументовРезультатовИнвентаризации</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ИТ_ДвиженияПакетаДокументовРезультатовИнвентаризации</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЛинейныйМенеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЧленКомиссии_ЛинейныйМенеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЧленКомиссии_СтаршийМенеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЧленКомиссии_СотрудникСлужбыБезопасности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредседательКомиссии</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИТ_СтатусыАкцептования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСтатуса</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КорректируемыйПакетДокументов</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ИТ_ПакетДокументовРезультатовИнвентаризации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Магазины</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Магазин</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Магазин_Адрес</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЮрЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЮрЛицо_Адрес</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЮрЛицо_Представление_1</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЮрЛицо_Представление_2</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Инвентаризации</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Магазин</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЮрЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументИнвентаризация</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.Инвентаризация</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Продавец</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Должность</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Магазин_Адрес</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>700</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтроки</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПриказОбИнвентаризации</Name>
							<Comment>Приказ об инвентаризации</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СличительнаяВедомостьИНВ19</Name>
							<Comment>Сличительная ведомость результатов инвентаризации товарно-материальных ценностей (унифицированная форма № ИНВ-19)</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИнвентаризационнаяОписьИНВ3</Name>
							<Comment>Инвентаризационная опись (унифицированная форма № ИНВ-3)</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбъяснительнаяПоНедостаче</Name>
							<Comment>Объяснительная по недостаче</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗаявлениеНаУдержание</Name>
							<Comment>Заявление на удержание</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПриказОбУдержании</Name>
							<Comment>Приказ об удержании</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПринятыВсеДокументы</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипУдержания</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ИТ_ТипыУдержанийПоРезультатамИнвентаризаций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаКУдержанию</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаИнвентаризации</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПриказОбИнвентаризации_ДатаПриема</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СличительнаяВедомостьИНВ19_ДатаПриема</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИнвентаризационнаяОписьИНВ3_ДатаПриема</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбъяснительнаяПоНедостаче_ДатаПриема</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗаявлениеНаУдержание_ДатаПриема</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПриказОбУдержании_ДатаПриема</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидОперации</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ИТ_ВидыОперацийПакетаДокументовРезультатовИнвентаризации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтказОтПодписи</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаКорректировки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаКУдержаниюДоКорректировки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЧислитсяНаТТ</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РезультатИнвентаризацииКВозмещению</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтработаноЧасов</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/InformationRegisters/ит_ТорговыеТочки_Ответственные.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ит_ТорговыеТочки_Ответственные</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СтМенеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Менеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИнженерТехПоддержки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РуководительНаправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТорговаяТочка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/ИТ_ТипыУдержанийПоРезультатамИнвентаризаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ИТ_ТипыУдержанийПоРезультатамИнвентаризаций</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ИзЗарплаты</Name>
					<Comment>Из заработной платы</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоПКО</Name>
					<Comment>Внесение наличных ДС по ПКО</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ИТ_СтатусыАкцептования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ИТ_СтатусыАкцептования</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Акцептован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеАкцептован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжидаетАкцепта</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Documents/ИТ_ПакетДокументовРезультатовИнвентаризации/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Перем БылоИзменениеФормы;

#Область ОбработкаСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Обработчик механизма "ВерсионированиеОбъектов"
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);
	
	// Обработчик подсистемы "Внешние обработки"
	ДополнительныеОтчетыИОбработки.ПриСозданииНаСервере(ЭтаФорма);
	
	// СтандартныеПодсистемы.Печать
	УправлениеПечатью.ПриСозданииНаСервере(ЭтотОбъект, Элементы.КоманднаяПанельПодменюПечать);
	
	ТекущийПользователь = ПолучитьТекущегоПользователя();
	
	Если Не(ЗначениеЗаполнено(Объект.ЛинейныйМенеджер))  
		И ЗначениеЗаполнено(ТекущийПользователь.Сотрудник) Тогда 
		Объект.ЛинейныйМенеджер = ТекущийПользователь.Сотрудник;		
	КонецЕсли;	
	
	Если Не(ЗначениеЗаполнено(Объект.ЧленКомиссии_ЛинейныйМенеджер))
		И ЗначениеЗаполнено(Объект.ЛинейныйМенеджер) Тогда 
		Объект.ЧленКомиссии_ЛинейныйМенеджер = Объект.ЛинейныйМенеджер;
	КонецЕсли;	
	
	ЗаполнениеРезультатовИнвентаризаций();
	
	МожноСтавитьПометку = Ложь;
	МожноСниматьПометку	= Ложь;
	
	ОбновитьИгнорируемуюНедостачу();
	ПопыткаУстановкиЖурналаПередачиДокументов();
	
	УстановитьДоступностьЭлементов();
	
	ЗаполнитьИнвентаризацииВШапке();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ЗаполнениеРезультатовИнвентаризаций();
КонецПроцедуры

&НаКлиенте
Процедура ЛинейныйМенеджерПриИзменении(Элемент)
	
	УстановитьМенеджеров();
	ЗаполнитьИнвентаризации(Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	
	ОбновитьПериод();	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	БылоИзменениеФормы = Ложь;

	Если ЗначениеЗаполнено(Объект.НачалоПериода) Тогда 
		Период.ДатаНачала = Объект.НачалоПериода;
	Иначе
		Период.ДатаНачала = НачалоДня(Объект.Дата);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.КонецПериода) Тогда 
		Период.ДатаОкончания = Объект.КонецПериода;
	Иначе
		Период.ДатаОкончания = КонецДня(Объект.Дата);
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Для Каждого СтрокаДокумента Из Объект.Инвентаризации Цикл
			Если Не ЗначениеЗаполнено(СтрокаДокумента.ИдентификаторСтроки) Тогда
				СтрокаДокумента.ИдентификаторСтроки = Новый УникальныйИдентификатор();	
				БылоИзменениеФормы = Истина;
			КонецЕсли;
		КонецЦикла;	
	КонецЕсли;
	
	УстановитьОформлениеЭлементов();
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияИгнорируемаяНедостачаНажатие(Элемент)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("РедактированиеИгнорируемойНедостачиЗавершение", ЭтаФорма);
	ОткрытьФорму("Константа.ИТ_ИгнорируемаяНедостача.ФормаКонстант",,,,,, ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ИнвентаризацииПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	ТекущаяСтрока = Элемент.ТекущиеДанные;
	
	Если Не ЗначениеЗаполнено(ТекущаяСтрока.ИдентификаторСтроки) Тогда
		ТекущаяСтрока.ИдентификаторСтроки = Новый УникальныйИдентификатор();
	КонецЕсли;
	
	ТекущаяСтрока.РезультатИнвентаризации = ПолучитьРезультатИнвентаризации(ТекущаяСтрока.ДокументИнвентаризация);	
	
	Если Элемент.ТекущийЭлемент.Имя <> "ИнвентаризацииПечать" Тогда
		БылоИзменениеФормы = Истина;
	КонецЕсли;
	
	Если Не БылоИзменениеФормы И Элемент.ТекущийЭлемент.Имя = "ИнвентаризацииПечать" Тогда
		БылоИзменениеФормы				= Ложь;
		ЭтотОбъект.Модифицированность	= Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьДоступностьЭлементов()
	
	ДоступныДействияСРеестром = ЗначениеЗаполнено(ЖурналПередачиДокументов)
								И (МожноСтавитьПометку Или МожноСниматьПометку);
								
	// Запрет редактирования акцептованных документов
	Если ДокументАкцептован() Тогда
		
		Элементы.Период.ТолькоПросмотр										= Истина;
		Элементы.Дата.ТолькоПросмотр										= Истина;
		Элементы.ЖурналПередачиДокументов.ТолькоПросмотр					= Истина;
		Элементы.Статус.ТолькоПросмотр										= Истина;
		Элементы.ЛинейныйМенеджер.ТолькоПросмотр							= Истина;
		Элементы.ПредседательКомиссии.ТолькоПросмотр						= Истина;
		Элементы.ЧленКомиссии_ЛинейныйМенеджер.ТолькоПросмотр				= Истина;
		Элементы.ЧленКомиссии_СотрудникСлужбыБезопасности.ТолькоПросмотр	= Истина;
		Элементы.ЧленКомиссии_СтаршийМенеджер.ТолькоПросмотр				= Истина;
		
		Для Каждого Колонка Из Элементы.Инвентаризации.ПодчиненныеЭлементы Цикл
			Если Колонка.Имя <> "ИнвентаризацииПечать" Тогда
				Колонка.ТолькоПросмотр = Истина;
			КонецЕсли;
		КонецЦикла;
		
		Элементы.Инвентаризации.КоманднаяПанель.ПодчиненныеЭлементы.ИнвентаризацииДобавить.Доступность					= Ложь;
		Элементы.Инвентаризации.КоманднаяПанель.ПодчиненныеЭлементы.ИнвентаризацииСкопировать.Доступность				= Ложь;
		Элементы.Инвентаризации.КоманднаяПанель.ПодчиненныеЭлементы.ИнвентаризацииЗакончитьРедактирование.Доступность	= Ложь;
		Элементы.Инвентаризации.КоманднаяПанель.ПодчиненныеЭлементы.ИнвентаризацииИзменить.Доступность					= Ложь;
		Элементы.Инвентаризации.КоманднаяПанель.ПодчиненныеЭлементы.ИнвентаризацииУдалить.Доступность					= Ложь;
		
		Элементы.Инвентаризации.КонтекстноеМеню.ПодчиненныеЭлементы.ИнвентаризацииКонтекстноеМенюДобавить.Доступность		= Ложь;
		Элементы.Инвентаризации.КонтекстноеМеню.ПодчиненныеЭлементы.ИнвентаризацииКонтекстноеМенюСкопировать.Доступность	= Ложь;
		Элементы.Инвентаризации.КонтекстноеМеню.ПодчиненныеЭлементы.ИнвентаризацииКонтекстноеМенюУдалить.Доступность		= Ложь;
		
		Элементы.ИнвентаризацииЗаполнитьИнвентаризации.Доступность		= Ложь;
		Элементы.ИнвентаризацииГруппаУстановитьПометку.Доступность		= Ложь;
		Элементы.ИнвентаризацииГруппаСнятьПометку.Доступность			= Ложь;
		
		ДоступныДействияСРеестром = Ложь;
	КонецЕсли;								
								
	Элементы.ИнвентаризацииГруппаРеестр.Доступность				= ДоступныДействияСРеестром;
	Элементы.ИнвентаризацииГруппаУстановитьПометку.Доступность	= ДоступныДействияСРеестром; 
	Элементы.ИнвентаризацииГруппаСнятьПометку.Доступность		= ДоступныДействияСРеестром; 
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОформлениеЭлементов()
	
	Если ЗначениеЗаполнено(Объект.КорректируемыйПакетДокументов) Тогда
		Элементы.ГруппаКорректируемыйПакет.Отображение = ОтображениеОбычнойГруппы.СильноеВыделение;
		Элементы.ГруппаКорректируемыйПакет.ОтображатьЗаголовок = Истина;
		Элементы.КорректируемыйПакетДокументов.ШрифтЗаголовка = Новый Шрифт(, 10, Истина,, Истина);
	Иначе
		Элементы.ГруппаКорректируемыйПакет.Отображение = ОтображениеОбычнойГруппы.Нет;
		Элементы.ГруппаКорректируемыйПакет.ОтображатьЗаголовок = Ложь;	
		Элементы.КорректируемыйПакетДокументов.ШрифтЗаголовка = Новый Шрифт;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЖурналПередачиДокументовПриИзменении(Элемент)
	ЖурналПередачиДокументовПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЖурналПередачиДокументовПриИзмененииНаСервере()
	
	//МожноСтавитьПометку = Ложь;
	//МожноСниматьПометку = Ложь;
	//
	//Если ЗначениеЗаполнено(ЖурналПередачиДокументов) Тогда
		
	МожноСтавитьПометку = ПравоПользователя("итРазрешеноСтавитьПометкуОПередачеПакетаДокументовИнвентаризации");
	МожноСниматьПометку = ПравоПользователя("итРазрешеноСниматьПометкуОПередачеПакетаДокументовИнвентаризации");
		
	//КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если ЗначениеЗаполнено(ЖурналПередачиДокументов) Тогда
		ТекущийОбъект.ДополнительныеСвойства.Вставить("ЖурналПередачиДокументов",	ЖурналПередачиДокументов);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ЗаполнениеРезультатовИнвентаризаций();
	
КонецПроцедуры

&НаКлиенте
Процедура ЧленКомиссии_ЛинейныйМенеджерПриИзменении(Элемент)
	
	//УстановитьМенеджеров();
	
КонецПроцедуры

&НаКлиенте
Процедура СтатусПриИзменении(Элемент)
	Объект.Ответственный	= ПолучитьТекущегоПользователя();
	Объект.ДатаСтатуса		= ТекущаяДата();
КонецПроцедуры

&НаКлиенте
Процедура КорректируемыйПакетДокументовПриИзменении(Элемент)
	Если Объект.КорректируемыйПакетДокументов = Объект.Ссылка Тогда
		Сообщить("В качестве корректируемого нельзя указывать текущий документ!");
		Объект.КорректируемыйПакетДокументов = ПредопределенноеЗначение("Документ.ИТ_ПакетДокументовРезультатовИнвентаризации.ПустаяСсылка");
	КонецЕсли;
	
	УстановитьОформлениеЭлементов();
КонецПроцедуры

#КонецОбласти

#Область ОбработкаСобытийТабличнойЧастиИнвентаризации

&НаКлиенте
Процедура ИнвентаризацииПриказОбИнвентаризацииПриИзменении(Элемент)
	УстановкаСнятиеФлагаПринятыВсеДокументы("ПриказОбИнвентаризации");
КонецПроцедуры

&НаКлиенте
Процедура ИнвентаризацииСличительнаяВедомостьИНВ19ПриИзменении(Элемент)
	УстановкаСнятиеФлагаПринятыВсеДокументы("СличительнаяВедомостьИНВ19");
КонецПроцедуры

&НаКлиенте
Процедура ИнвентаризацииИнвентаризационнаяОписьИНВ3ПриИзменении(Элемент)
	УстановкаСнятиеФлагаПринятыВсеДокументы("ИнвентаризационнаяОписьИНВ3");
КонецПроцедуры

&НаКлиенте
Процедура ИнвентаризацииОбъяснительнаяПоНедостачеПриИзменении(Элемент)
	УстановкаСнятиеФлагаПринятыВсеДокументы("ОбъяснительнаяПоНедостаче");
КонецПроцедуры

&НаКлиенте
Процедура ИнвентаризацииЗаявлениеНаУдержаниеПриИзменении(Элемент)
	УстановкаСнятиеФлагаПринятыВсеДокументы("ЗаявлениеНаУдержание");
КонецПроцедуры

&НаКлиенте
Процедура ИнвентаризацииПриказОбУдержанииПриИзменении(Элемент)
	УстановкаСнятиеФлагаПринятыВсеДокументы("ПриказОбУдержании");
КонецПроцедуры

&НаКлиенте
Процедура ИнвентаризацииПринятыВсеДокументыПриИзменении(Элемент)
	УстановкаПризнакаРеестраПоВыделеннымСтрокам("", Элементы.Инвентаризации.ТекущиеДанные.ПринятыВсеДокументы);
КонецПроцедуры

&НаКлиенте
Процедура УстановкаСнятиеФлагаПринятыВсеДокументы(ИмяКолонки)
	
	СтрокаДокумента = Элементы.Инвентаризации.ТекущиеДанные;
	Если Не СтрокаДокумента[ИмяКолонки] Тогда
		СтрокаДокумента.ПринятыВсеДокументы = Ложь;
	КонецЕсли;	
	
	Если СтрокаДокумента.ТипУдержания = ПредопределенноеЗначение("Перечисление.ИТ_ТипыУдержанийПоРезультатамИнвентаризаций.ПоПКО") Тогда
		Если СтрокаДокумента.ПриказОбИнвентаризации
			И СтрокаДокумента.СличительнаяВедомостьИНВ19
			И СтрокаДокумента.ИнвентаризационнаяОписьИНВ3
			И СтрокаДокумента.ОбъяснительнаяПоНедостаче
			И СтрокаДокумента.ПриказОбУдержании Тогда
			СтрокаДокумента.ПринятыВсеДокументы = Истина;
		КонецЕсли;
	ИначеЕсли СтрокаДокумента.РезультатИнвентаризации > ИгнорируемаяНедостача Тогда
		Если СтрокаДокумента.ПриказОбИнвентаризации
			И СтрокаДокумента.СличительнаяВедомостьИНВ19
			И СтрокаДокумента.ИнвентаризационнаяОписьИНВ3 Тогда	
			СтрокаДокумента.ПринятыВсеДокументы = Истина;
		КонецЕсли;
	Иначе
		Если СтрокаДокумента.ПриказОбИнвентаризации
			И СтрокаДокумента.СличительнаяВедомостьИНВ19
			И СтрокаДокумента.ИнвентаризационнаяОписьИНВ3
			И СтрокаДокумента.ОбъяснительнаяПоНедостаче
			И СтрокаДокумента.ЗаявлениеНаУдержание
			И СтрокаДокумента.ПриказОбУдержании Тогда
			СтрокаДокумента.ПринятыВсеДокументы = Истина;
		КонецЕсли;
	КонецЕсли;

	УстановкаДатыПринятияДокумента(ИмяКолонки, СтрокаДокумента);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановкаДатыПринятияДокумента(ИмяКолонки, СтрокаДокумента = Неопределено)
	
	Если СтрокаДокумента = Неопределено Тогда
		СтрокаДокумента = Элементы.Инвентаризации.ТекущиеДанные;
	КонецЕсли;

	ИмяКолонкиСДатой = ИмяКолонки + "_ДатаПриема";
	
	Если СтрокаДокумента[ИмяКолонки] Тогда
		СтрокаДокумента[ИмяКолонкиСДатой] = ТекущаяДата();
	Иначе
		СтрокаДокумента[ИмяКолонкиСДатой] = Дата(1,1,1);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнениеРезультатовИнвентаризаций()
	
	Для Каждого СтрокаДокумента Из Объект.Инвентаризации Цикл
		СтрокаДокумента.РезультатИнвентаризации = ПолучитьРезультатИнвентаризации(СтрокаДокумента.ДокументИнвентаризация);	
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьРезультатИнвентаризации(ДокументИнвентаризация)
	
	Возврат	ИТ_СпециальныйМодульСервер.ПолучитьРезультатИнвентаризации(ДокументИнвентаризация);
	//Если ЗначениеЗаполнено(ДокументИнвентаризация) Тогда
	//	Возврат ДокументИнвентаризация.Товары.Итог("СуммаФакт") - ДокументИнвентаризация.Товары.Итог("Сумма");	
	//КонецЕсли;
	//
	//Возврат 0;
	
КонецФункции

&НаКлиенте
Процедура ИнвентаризацииПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = ДокументАкцептован();
КонецПроцедуры

&НаКлиенте
Процедура ИнвентаризацииПередУдалением(Элемент, Отказ)
	Отказ = ДокументАкцептован();
КонецПроцедуры

&НаКлиенте
Процедура ИнвентаризацииДокументИнвентаризацияПриИзмененииНаСервере()
	
	ТекущиеДанные = Элементы.Инвентаризации.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено Тогда
		Если ЗначениеЗаполнено(ТекущиеДанные.ДокументИнвентаризация) Тогда
			ТекущиеДанные.Магазин = ПолучитьРекСсылки(ТекущиеДанные.ДокументИнвентаризация, "ПодразделениеКомпании");
			ИнвентаризацииМагазинПриИзмененииНаСервере();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИнвентаризацииМагазинПриИзмененииНаСервере()
	
	ТекущиеДанные = Элементы.Инвентаризации.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено Тогда
		Если ЗначениеЗаполнено(ТекущиеДанные.Магазин) Тогда
			ТекущиеДанные.ЮрЛицо = ПолучитьРекСсылки(ТекущиеДанные.Магазин, "Организация");
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИнвентаризацииМагазинПриИзменении(Элемент)
		
	ИнвентаризацииМагазинПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ИнвентаризацииДокументИнвентаризацияПриИзменении(Элемент)
	
	ИнвентаризацииДокументИнвентаризацияПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Функция ПолучитьРекСсылки(СсылкаЭл, ИмяРеквизита)
	
	Возврат СсылкаЭл[ИмяРеквизита];
	
КонецФункции


#КонецОбласти

#Область ОбработкаКомандФормы

&НаКлиенте
Процедура ЗаполнитьИнвентаризации(Команда)
	
	Для Каждого СтрокаДок Из Объект.Инвентаризации Цикл
		Если СтрокаДок.ПринятыВсеДокументы
			Или СтрокаДок.ПриказОбИнвентаризации	
			Или СтрокаДок.СличительнаяВедомостьИНВ19
			Или СтрокаДок.ИнвентаризационнаяОписьИНВ3
			Или СтрокаДок.ОбъяснительнаяПоНедостаче
			Или СтрокаДок.ЗаявлениеНаУдержание
			Или СтрокаДок.ПриказОбУдержании Тогда
			Сообщить("Часть документов по пакету уже принята. Перезаполнение списка инвентаризаций невозможно!");
			Возврат;
		КонецЕсли;
	КонецЦикла;
	
	Если Объект.Инвентаризации.Количество() > 0 Тогда
		Режим = РежимДиалогаВопрос.ДаНет;
		Ответ = Вопрос("Список инвентаризаций будет очищен! Продолжить?", Режим);
		
		Если Ответ = КодВозвратаДиалога.Нет Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	БылоИзменениеФормы				= Истина;
	ЭтотОбъект.Модифицированность	= Истина;
	
	ЗаполнитьИнвентаризацииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыделитьВсеСтроки(Команда)
	ГрупповаяОбработкаСтрокНаСервере(Истина);
КонецПроцедуры

&НаКлиенте
Процедура УбратьВыделениеВсехСтрок(Команда)
	ГрупповаяОбработкаСтрокНаСервере(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ИнвертироватьВыделение(Команда)
	ГрупповаяОбработкаСтрокНаСервере(Ложь, Истина);
КонецПроцедуры

&НаСервере
Процедура ГрупповаяОбработкаСтрокНаСервере(ЗначениеПараметра, Инверсия = Ложь)
	
	Если Инверсия Тогда
		Для Каждого СтрокаДокумента Из Объект.Инвентаризации Цикл
			СтрокаДокумента.Печать = Не СтрокаДокумента.Печать;
		КонецЦикла;
	Иначе
		Для Каждого СтрокаДокумента Из Объект.Инвентаризации Цикл
			СтрокаДокумента.Печать = ЗначениеПараметра;
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура УстановитьПометкуПоВсемДокументам(Команда)
	УстановкаПризнакаРеестра(Истина);	
КонецПроцедуры

&НаКлиенте
Процедура СнятьПометкуПоВсемДокументам(Команда)
	УстановкаПризнакаРеестра(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПометкуПоМагазину(Команда)
	УстановкаПризнакаРеестраПоВыделеннымСтрокам("Магазин", Истина);
КонецПроцедуры

&НаКлиенте
Процедура СнятьПометкуПоМагазину(Команда)
	УстановкаПризнакаРеестраПоВыделеннымСтрокам("Магазин", Ложь);
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПометкуПоДокументу(Команда)
	УстановкаПризнакаРеестраПоВыделеннымСтрокам("ДокументИнвентаризация", Истина);
КонецПроцедуры

&НаКлиенте
Процедура СнятьПометкуПоДокументу(Команда)
	УстановкаПризнакаРеестраПоВыделеннымСтрокам("ДокументИнвентаризация", Ложь);
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПометкуПоПродавцу(Команда)
	УстановкаПризнакаРеестраПоВыделеннымСтрокам("Продавец", Истина);
КонецПроцедуры

&НаКлиенте
Процедура СнятьПометкуПоПродавцу(Команда)
	УстановкаПризнакаРеестраПоВыделеннымСтрокам("Продавец", Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьСкрытьДополнительныеДанные(Команда)
	
	ВидимостьДатПриема = Элементы.ИнвентаризацииГруппаДатыПринятияДокументов.Видимость;
	
	Элементы.ИнвентаризацииГруппаДатыПринятияДокументов.Видимость		= Не ВидимостьДатПриема;
	Элементы.ИнвентаризацииПоказатьСкрытьДополнительныеДанные.Пометка	= Не ВидимостьДатПриема;
	//Возможно в дальнейшем сюда добавить адрес магазина, юр.лицо, должность и др.
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// СтандартныеПодсистемы.Печать
&НаКлиенте
//Процедура Подключаемый_ВыполнитьКомандуПечати(Команда)
Процедура Подключаемый_ОбработкаКомандыФормы(Команда)
	
	ДополнениеКомандПечатиНаСервере(); 
	ОбновитьПовторноИспользуемыеЗначения();
	УправлениеПечатьюКлиент.ВыполнитьПодключаемуюКомандуПечати(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры

//Добавляет в ДополнительныеПараметры Команды печати те документы инвентаризации, которые отметили для печати
&НаСервере
Процедура ДополнениеКомандПечатиНаСервере()
	
	АдресКомандПечатиВоВременномХранилище = Команды.Найти("АдресКомандПечатиВоВременномХранилище").Действие;
	ТаблицаКоманд = ПолучитьИзВременногоХранилища(АдресКомандПечатиВоВременномХранилище);
	
	МассивСтрок = Новый Массив();
	
	Для Каждого СтрокаДокумента Из Объект.Инвентаризации Цикл
		Если СтрокаДокумента.Печать Тогда
			МассивСтрок.Добавить(СтрокаДокумента.ИдентификаторСтроки);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого СтрКоманда Из ТаблицаКоманд Цикл
		СтрКоманда.ДополнительныеПараметры.Вставить("МассивИнвентаризаций", МассивСтрок);
	КонецЦикла;
	
	ПоместитьВоВременноеХранилище(ТаблицаКоманд, АдресКомандПечатиВоВременномХранилище);

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьИнвентаризацииНаСервере(МассивМагазинов = Неопределено, МассивИнвентаризаций = Неопределено)
	
	Документы.ИТ_ПакетДокументовРезультатовИнвентаризации.ЗаполнитьИнвентаризацииВПакете(Объект);
	
	Если Объект.Инвентаризации.Количество() Тогда
		
		ПерваяИнвентаризация      = Объект.Инвентаризации[0].ДокументИнвентаризация;
		ОрганизацияИнвентаризации = ПерваяИнвентаризация.Организация;
		ЕРПМастерКлючОООфмр = "00000000150";
		ОрганизацияФМР 		= ОрганизацияИнвентаризации.ЕРПМастерКлюч = ЕРПМастерКлючОООфмр;
		Если ОрганизацияФМР Тогда
			СотрудникРябых  = Справочники.Сотрудники.НайтиПоНаименованию("Рябых Светлана Олеговна", Истина);
			Объект.ПредседательКомиссии = СотрудникРябых;
		КонецЕсли;
		
		ЗаполнитьИнвентаризацииВШапке();
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьИнвентаризацииВШапке()
	
	ОбТЗИнвент = РеквизитФормыВЗначение("тзИнвентаризации", Тип("ТаблицаЗначений"));
	ОбТЗИнвент.Очистить();
	Для Каждого стрИнвентаризации Из Объект.Инвентаризации Цикл			
		Если ОбТЗИнвент.Найти(стрИнвентаризации.ДокументИнвентаризация, "Инвентаризация") = НЕОПРЕДЕЛЕНО Тогда
			 НовСтр = ОбТЗИнвент.Добавить();
			 НовСтр.Инвентаризация = стрИнвентаризации.ДокументИнвентаризация;
		КонецЕсли;		
	КонецЦикла;
	ЗначениеВРеквизитФормы(ОбТЗИнвент, "тзИнвентаризации");
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьПериод()
	
	Объект.НачалоПериода	= НачалоДня(Период.ДатаНачала);
	Объект.КонецПериода		= КонецДня(Период.ДатаОкончания);
	
	ЗаполнитьИнвентаризации(Неопределено);
		
КонецПроцедуры

&НаКлиенте
Процедура РедактированиеИгнорируемойНедостачиЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	ОбновитьИгнорируемуюНедостачу();
	
КонецПроцедуры	

&НаСервере
Процедура ОбновитьИгнорируемуюНедостачу()
	
	ИгнорируемаяНедостача = Константы.ИТ_ИгнорируемаяНедостача.Получить();
	Элементы.ДекорацияИгнорируемаяНедостача.Заголовок = СтрШаблон(
	"Печать Объяснительной, Приказа и Заявления на удержание только для инвентаризаций, результат которых меньше %1 ₽ (нажмите чтобы изменить)", 
	Формат(ИгнорируемаяНедостача, "ЧДЦ=2; ЧН=0,00; ЧГ=3,0"));
	
КонецПроцедуры

&НаСервере
Процедура ПопыткаУстановкиЖурналаПередачиДокументов()
	
	//Идентификатор = Новый УникальныйИдентификатор("ed4719cc-2584-11ea-8137-005056bc3a88");
	//ЖурналПередачиДокументов = Справочники.ИТ_ЖурналПередачиДокументов.ПолучитьСсылку(Идентификатор);
	
	ЖурналПередачиДокументов = Справочники.ИТ_ЖурналПередачиДокументов.НайтиПоКоду("000000001");
	
	Элементы.ЖурналПередачиДокументов.СписокВыбора.Добавить(ЖурналПередачиДокументов);
	
	ЖурналПередачиДокументовПриИзмененииНаСервере();
	
КонецПроцедуры

Процедура УстановитьМенеджеров()
	
	Объект.ЧленКомиссии_ЛинейныйМенеджер = Объект.ЛинейныйМенеджер;
	
	Запрос = Новый Запрос();
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ит_ТорговыеТочки_ОтветственныеСрезПоследних.СтМенеджер КАК СтаршийМенеджер,
		|	МАКСИМУМ(ит_ТорговыеТочки_ОтветственныеСрезПоследних.Период) КАК Период
		|ИЗ
		|	РегистрСведений.ит_ТорговыеТочки_Ответственные.СрезПоследних(&ДатаДокумента, Менеджер = &ЛинейныйМенеджер) КАК ит_ТорговыеТочки_ОтветственныеСрезПоследних
		|
		|СГРУППИРОВАТЬ ПО
		|	ит_ТорговыеТочки_ОтветственныеСрезПоследних.СтМенеджер
		|
		|УПОРЯДОЧИТЬ ПО
		|	Период УБЫВ";
	
	Запрос.УстановитьПараметр("ДатаДокумента",		Объект.Дата);
	Запрос.УстановитьПараметр("ЛинейныйМенеджер",	Объект.ЛинейныйМенеджер);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Объект.ЧленКомиссии_СтаршийМенеджер = ВыборкаДетальныеЗаписи.СтаршийМенеджер;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере 
Функция ПолучитьТекущегоПользователя()
	Возврат ПараметрыСеанса.ТекущийПользователь;	
КонецФункции

&НаСервере
Функция ДокументАкцептован()
	Возврат Объект.Статус = Перечисления.ИТ_СтатусыАкцептования.Акцептован;
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИзмененияДанныхРеестра

&НаКлиенте
Процедура УстановкаПризнакаРеестра(Значение)
	
	Для Каждого СтрокаДокумента Из Объект.Инвентаризации Цикл
		//ТекущийИдентификатор = СтрокаДокумента.ИдентификаторСтроки;
		
		СтрокаДокумента.ПринятыВсеДокументы			= Значение;
		СтрокаДокумента.ПриказОбИнвентаризации		= Значение;
		СтрокаДокумента.СличительнаяВедомостьИНВ19	= Значение;
		СтрокаДокумента.ИнвентаризационнаяОписьИНВ3	= Значение;
		СтрокаДокумента.ОбъяснительнаяПоНедостаче	= Значение;
		СтрокаДокумента.ЗаявлениеНаУдержание		= Значение;
		СтрокаДокумента.ПриказОбУдержании			= Значение;
		
		УстановкаДатыПринятияДокумента("ПриказОбИнвентаризации",		СтрокаДокумента);
		УстановкаДатыПринятияДокумента("СличительнаяВедомостьИНВ19",	СтрокаДокумента);	
		УстановкаДатыПринятияДокумента("ИнвентаризационнаяОписьИНВ3",	СтрокаДокумента);	
		УстановкаДатыПринятияДокумента("ОбъяснительнаяПоНедостаче",		СтрокаДокумента);	
		УстановкаДатыПринятияДокумента("ЗаявлениеНаУдержание",			СтрокаДокумента);	
		УстановкаДатыПринятияДокумента("ПриказОбУдержании",				СтрокаДокумента);	
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановкаПризнакаРеестраПоВыделеннымСтрокам(КолонкаОтбора = "", Значение = Неопределено)
	
	Для Каждого ИндексСтроки Из Элементы.Инвентаризации.ВыделенныеСтроки Цикл
		СтрокаДокумента = Объект.Инвентаризации.НайтиПоИдентификатору(ИндексСтроки);
		
	    ИзменениеДанныхРеестра("ПринятыВсеДокументы",			СтрокаДокумента, КолонкаОтбора, Значение);
		ИзменениеДанныхРеестра("ПриказОбИнвентаризации",		СтрокаДокумента, КолонкаОтбора, Значение);
		ИзменениеДанныхРеестра("СличительнаяВедомостьИНВ19",	СтрокаДокумента, КолонкаОтбора, Значение);
		ИзменениеДанныхРеестра("ИнвентаризационнаяОписьИНВ3",	СтрокаДокумента, КолонкаОтбора, Значение);
		ИзменениеДанныхРеестра("ОбъяснительнаяПоНедостаче",		СтрокаДокумента, КолонкаОтбора, Значение);
		ИзменениеДанныхРеестра("ЗаявлениеНаУдержание",			СтрокаДокумента, КолонкаОтбора, Значение);
		ИзменениеДанныхРеестра("ПриказОбУдержании",				СтрокаДокумента, КолонкаОтбора, Значение);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменениеДанныхРеестра(ТекущаяКолонка, СтрокаДокумента, КолонкаОтбора = "", ПринудительноеЗначение = Неопределено)
	
	Если СтрокаДокумента = Неопределено Тогда
		ТекущиеДанные = Элементы.Инвентаризации.ТекущиеДанные;
	Иначе
		ТекущиеДанные = СтрокаДокумента;
	КонецЕсли;
	
	//Проверка прав
	НельзяИзменить = Ложь;
	ЗапрещенноеДействие = "менять пометку ";
	Если ПринудительноеЗначение <> Неопределено Тогда
		Если ПринудительноеЗначение И Не МожноСтавитьПометку Тогда
			НельзяИзменить = Истина;
			ЗапрещенноеДействие = "устанавливать пометку ";
		ИначеЕсли Не ПринудительноеЗначение И Не МожноСниматьПометку Тогда
			НельзяИзменить = Истина;
			ЗапрещенноеДействие = "снимать пометку ";
		КонецЕсли;
		Если НельзяИзменить Тогда
			Возврат;
		КонецЕсли;
	Иначе
		Если ТекущиеДанные[ТекущаяКолонка] И Не МожноСтавитьПометку Тогда
			НельзяИзменить = Истина;
			ЗапрещенноеДействие = "устанавливать пометку ";
		ИначеЕсли Не ТекущиеДанные[ТекущаяКолонка] И Не МожноСниматьПометку Тогда
			НельзяИзменить = Истина;
			ЗапрещенноеДействие = "снимать пометку ";
		КонецЕсли;
		Если НельзяИзменить Тогда
			ТекущиеДанные[ТекущаяКолонка] = Не ТекущиеДанные[ТекущаяКолонка];
			Сообщить("Вам нельзя " + ЗапрещенноеДействие + " в колонке " + ТекущаяКолонка);	
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	
	Структура_ТекущиеДанные = Новый Структура();
	Структура_ТекущиеДанные.Вставить("Магазин",							ТекущиеДанные.Магазин);
	Структура_ТекущиеДанные.Вставить("ДокументИнвентаризация",			ТекущиеДанные.ДокументИнвентаризация);
	Структура_ТекущиеДанные.Вставить("Продавец",						ТекущиеДанные.Продавец);
	Структура_ТекущиеДанные.Вставить("ПриказОбИнвентаризации",			ТекущиеДанные.ПриказОбИнвентаризации);
	Структура_ТекущиеДанные.Вставить("СличительнаяВедомостьИНВ19",		ТекущиеДанные.СличительнаяВедомостьИНВ19);
	Структура_ТекущиеДанные.Вставить("ИнвентаризационнаяОписьИНВ3",		ТекущиеДанные.ИнвентаризационнаяОписьИНВ3);
	Структура_ТекущиеДанные.Вставить("ОбъяснительнаяПоНедостаче",		ТекущиеДанные.ОбъяснительнаяПоНедостаче);
	Структура_ТекущиеДанные.Вставить("ЗаявлениеНаУдержание",			ТекущиеДанные.ЗаявлениеНаУдержание);
	Структура_ТекущиеДанные.Вставить("ПриказОбУдержании",				ТекущиеДанные.ПриказОбУдержании);
	
	Если Не ПустаяСтрока(ТекущаяКолонка) И ПринудительноеЗначение <> Неопределено Тогда
		СтрокаДокумента[ТекущаяКолонка] = ПринудительноеЗначение;
		
		Если ТекущаяКолонка <> "ПринятыВсеДокументы" Тогда
			УстановкаДатыПринятияДокумента(ТекущаяКолонка, СтрокаДокумента);	
		КонецЕсли;
	КонецЕсли;
	
	Если Не ПустаяСтрока(КолонкаОтбора) И ПринудительноеЗначение <> Неопределено Тогда
		ПараметрыОтбора		= Новый Структура(КолонкаОтбора, Структура_ТекущиеДанные[КолонкаОтбора]);
		ИзменяемыеСтроки	= Объект.Инвентаризации.НайтиСтроки(ПараметрыОтбора);
		
		Для Каждого ИзменяемаяСтрока Из ИзменяемыеСтроки Цикл
			//ЗначениеИзменения = Структура_ТекущиеДанные[ТекущаяКолонка];
			//ИзменяемаяСтрока[ТекущаяКолонка] = ЗначениеИзменения; 
			ИзменяемаяСтрока[ТекущаяКолонка] = ПринудительноеЗначение;
			
			Если ТекущаяКолонка <> "ПринятыВсеДокументы" Тогда
				УстановкаДатыПринятияДокумента(ТекущаяКолонка, ИзменяемаяСтрока);	
			КонецЕсли;
		КонецЦикла; 	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПроверкаСтрокиТаблицыДанныхРеестра(СтрокаДокумента, СтрокаСохраненныхДанныхРеестра, КолонкаПроверки, ИзменениеНеРазрешено, ТаблицаОшибок)
	
	//ТекущееЗначение		= СтрокаДокумента[КолонкаПроверки];
	//СохраненноеЗначение	= СтрокаСохраненныхДанныхРеестра[КолонкаПроверки];
	//
	//НельзяИзменить = Ложь;
	//ЗапрещенноеДействие = "";
	//Если ТекущееЗначение <> СохраненноеЗначение Тогда
	//	Если ТекущееЗначение И Не МожноСтавитьПометку Тогда
	//		НельзяИзменить = Истина;
	//		ЗапрещенноеДействие = "устанавливать пометку ";
	//	ИначеЕсли Не ТекущееЗначение И Не МожноСниматьПометку Тогда
	//		НельзяИзменить = Истина;
	//		ЗапрещенноеДействие = "снимать пометку ";
	//	КонецЕсли;
	//	
	//	Если НельзяИзменить Тогда
	//		НоваяСтрокаОшибок = ТаблицаОшибок.Добавить();
	//		НоваяСтрокаОшибок.ИдентификаторСтроки	= СтрокаДокумента.ИдентификаторСтроки;
	//		НоваяСтрокаОшибок.НомерСтроки			= СтрокаДокумента.НомерСтроки;
	//		НоваяСтрокаОшибок[КолонкаПроверки]		= Истина;
	//		НоваяСтрокаОшибок.ЗапрещенноеДействие   = ЗапрещенноеДействие;
	//		ИзменениеНеРазрешено = Истина;
	//	КонецЕсли;
	//КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПерераспределитьСуммыКУдержаниюНаСервере()
	Документы.ИТ_ПакетДокументовРезультатовИнвентаризации.ПерераспределениеСуммКУдержанию(Объект);
КонецПроцедуры

&НаКлиенте
Процедура ПерераспределитьСуммыКУдержанию(Команда)
	
	Если Объект.Инвентаризации.Количество() > 0 Тогда
		Режим = РежимДиалогаВопрос.ДаНет;
		Ответ = Вопрос("Суммы к удержанию будут перезаполнены! Данные о принятых документах будут утеряны! Продолжить?", Режим);
		
		Если Ответ = КодВозвратаДиалога.Нет Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	ПерераспределитьСуммыКУдержаниюНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьИнвентаризацииПредварительныйИтог(Команда)
	
	Для Каждого СтрокаДок Из Объект.Инвентаризации Цикл
		Если СтрокаДок.ПринятыВсеДокументы
			Или СтрокаДок.ПриказОбИнвентаризации	
			Или СтрокаДок.СличительнаяВедомостьИНВ19
			Или СтрокаДок.ИнвентаризационнаяОписьИНВ3
			Или СтрокаДок.ОбъяснительнаяПоНедостаче
			Или СтрокаДок.ЗаявлениеНаУдержание
			Или СтрокаДок.ПриказОбУдержании Тогда
			Сообщить("Часть документов по пакету уже принята. Перезаполнение списка инвентаризаций невозможно!");
			Возврат;
		КонецЕсли;
	КонецЦикла;
	
	Если Объект.Инвентаризации.Количество() > 0 Тогда
		Режим = РежимДиалогаВопрос.ДаНет;
		Ответ = Вопрос("Список инвентаризаций будет очищен! Продолжить?", Режим);
		
		Если Ответ = КодВозвратаДиалога.Нет Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	БылоИзменениеФормы				= Истина;
	ЭтотОбъект.Модифицированность	= Истина;
	
	ЗаполнитьИнвентаризацииНаСервереПредварительныйИтог();

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьИнвентаризацииНаСервереПредварительныйИтог(МассивМагазинов = Неопределено, МассивИнвентаризаций = Неопределено)
	
	Документы.ИТ_ПакетДокументовРезультатовИнвентаризации.ЗаполнитьИнвентаризацииВПакетеПредварительныйИтог(Объект);
	
	Если Объект.Инвентаризации.Количество() Тогда
		
		ПерваяИнвентаризация      = Объект.Инвентаризации[0].ДокументИнвентаризация;
		ОрганизацияИнвентаризации = ПерваяИнвентаризация.Организация;
		ЕРПМастерКлючОООфмр = "00000000150";
		ОрганизацияФМР 		= ОрганизацияИнвентаризации.ЕРПМастерКлюч = ЕРПМастерКлючОООфмр;
		Если ОрганизацияФМР Тогда
			СотрудникРябых  = Справочники.Сотрудники.НайтиПоНаименованию("Рябых Светлана Олеговна", Истина);
			Объект.ПредседательКомиссии = СотрудникРябых;
		КонецЕсли;
		
		ЗаполнитьИнвентаризацииВШапке();
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
